test_results/k6_output_auto_inc.txt
=================================== create ===================================

Creating url-shortener_stress-test_run ... done

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

 Init   [--------------------------------------] runner
 Init   [--------------------------------------] options
 Init   [--------------------------------------] execution scheduler
Init   [--------------------------------------] Init engine
Init   [--------------------------------------] Init metric outputs
Init   [--------------------------------------] Init API server
  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 executors, 30 max VUs, 1m30s max duration (incl. graceful stop):
           * create: 30 looping VUs for 1m0s (exec: create, gracefulStop: 30s)

Init   [--------------------------------------] Init VUs
Init   [--------------------------------------] Start test

    ✓ create OK status

    █ setup

    checks.....................: 100.00% ✓ 9599 ✗ 0   
    data_received..............: 1.9 MB  32 kB/s
    data_sent..................: 1.9 MB  31 kB/s
    http_req_blocked...........: avg=44.47µs  min=1.17µs  med=2.81µs   max=21.5ms  p(90)=4.9µs    p(95)=15.11µs 
    http_req_connecting........: avg=12.21µs  min=0s      med=0s       max=15.66ms p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=187.36ms min=8.66ms  med=160.17ms max=1.25s   p(90)=353.97ms p(95)=415.5ms 
    http_req_receiving.........: avg=163.53µs min=20.17µs med=116.78µs max=6.7ms   p(90)=338.01µs p(95)=413.35µs
    http_req_sending...........: avg=40.95µs  min=8.59µs  med=21.21µs  max=1.86ms  p(90)=79.23µs  p(95)=111.39µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=187.15ms min=8.59ms  med=159.97ms max=1.25s   p(90)=353.77ms p(95)=415.3ms 
    http_reqs..................: 9599    159.525942/s
    iteration_duration.........: avg=187.67ms min=5.63µs  med=160.4ms  max=1.25s   p(90)=354.35ms p(95)=415.89ms
    iterations.................: 9599    159.525942/s
    vus........................: 30      min=30 max=30
    vus_max....................: 30      min=30 max=30


=================================== resolve ===================================

Creating url-shortener_stress-test_run ... done

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

 Init   [--------------------------------------] runner
 Init   [--------------------------------------] options
 Init   [--------------------------------------] execution scheduler
Init   [--------------------------------------] Init engine
Init   [--------------------------------------] Init metric outputs
Init   [--------------------------------------] Init API server
  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 executors, 500 max VUs, 1m30s max duration (incl. graceful stop):
           * resolve: 500 looping VUs for 1m0s (exec: resolve, gracefulStop: 30s)

Init   [--------------------------------------] Init VUs
Init   [--------------------------------------] Start test

    ✓ Not found status
    ✓ resolve OK status

    █ setup

    checks.....................: 100.00% ✓ 30277 ✗ 0    
    data_received..............: 5.8 MB  94 kB/s
    data_sent..................: 2.5 MB  41 kB/s
    http_req_blocked...........: avg=1.47ms   min=907ns   med=2.59µs   max=159.88ms p(90)=5.18µs   p(95)=17.29µs 
    http_req_connecting........: avg=1.45ms   min=0s      med=0s       max=158.4ms  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=996.52ms min=4.47ms  med=856.97ms max=4.03s    p(90)=1.86s    p(95)=2.22s   
    http_req_receiving.........: avg=190.39µs min=16.24µs med=144.61µs max=17.68ms  p(90)=357.42µs p(95)=445.64µs
    http_req_sending...........: avg=454.08µs min=4.77µs  med=14.93µs  max=80.81ms  p(90)=72.75µs  p(95)=113.89µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=995.88ms min=4.37ms  med=856.26ms max=3.98s    p(90)=1.86s    p(95)=2.22s   
    http_reqs..................: 30278   490.930863/s
    iteration_duration.........: avg=998.29ms min=4.7ms   med=857.72ms max=4.13s    p(90)=1.86s    p(95)=2.23s   
    iterations.................: 30277   490.914649/s
    vus........................: 152     min=152 max=500
    vus_max....................: 500     min=500 max=500