test_results/k6_output_snowflake_docker.txt
=================================== create ===================================

Creating url-shortener_stress-test_run ... done

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

 Init   [--------------------------------------] runner
 Init   [--------------------------------------] options
 Init   [--------------------------------------] execution scheduler
Init   [--------------------------------------] Init engine
Init   [--------------------------------------] Init metric outputs
Init   [--------------------------------------] Init API server
  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 executors, 30 max VUs, 1m30s max duration (incl. graceful stop):
           * create: 30 looping VUs for 1m0s (exec: create, gracefulStop: 30s)

Init   [--------------------------------------] Init VUs
Init   [--------------------------------------] Start test

    ✓ create OK status

    █ setup

    checks.....................: 100.00% ✓ 3042 ✗ 0   
    data_received..............: 617 kB  10 kB/s
    data_sent..................: 586 kB  9.7 kB/s
    http_req_blocked...........: avg=122.53µs min=1.28µs  med=3.38µs   max=17.65ms p(90)=10.76µs  p(95)=41.33µs 
    http_req_connecting........: avg=48.11µs  min=0s      med=0s       max=10.99ms p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=593.04ms min=25.09ms med=495.24ms max=3.48s   p(90)=995.21ms p(95)=1.36s   
    http_req_receiving.........: avg=382.72µs min=17.37µs med=197.45µs max=99.95ms p(90)=515.47µs p(95)=728.75µs
    http_req_sending...........: avg=108.32µs min=8.18µs  med=27.85µs  max=17.77ms p(90)=116.61µs p(95)=195.84µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=592.55ms min=24.44ms med=495.05ms max=3.47s   p(90)=994.63ms p(95)=1.36s   
    http_reqs..................: 3042    50.378989/s
    iteration_duration.........: avg=593.48ms min=6.5µs   med=495.52ms max=3.48s   p(90)=995.34ms p(95)=1.36s   
    iterations.................: 3042    50.378989/s
    vus........................: 30      min=30 max=30
    vus_max....................: 30      min=30 max=30


=================================== resolve ===================================

Creating url-shortener_stress-test_run ... done

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

 Init   [--------------------------------------] runner
 Init   [--------------------------------------] options
 Init   [--------------------------------------] execution scheduler
Init   [--------------------------------------] Init engine
Init   [--------------------------------------] Init metric outputs
Init   [--------------------------------------] Init API server
  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 executors, 500 max VUs, 1m30s max duration (incl. graceful stop):
           * resolve: 500 looping VUs for 1m0s (exec: resolve, gracefulStop: 30s)

Init   [--------------------------------------] Init VUs
Init   [--------------------------------------] Start test

    ✓ Not found status
    ✓ resolve OK status

    █ setup

    checks.....................: 100.00% ✓ 25877 ✗ 0    
    data_received..............: 4.9 MB  81 kB/s
    data_sent..................: 2.3 MB  37 kB/s
    http_req_blocked...........: avg=1.68ms   min=966ns   med=2.66µs   max=246.95ms p(90)=5.27µs   p(95)=19.61µs 
    http_req_connecting........: avg=1.65ms   min=0s      med=0s       max=183.2ms  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=1.16s    min=9.12ms  med=1.01s    max=7.34s    p(90)=2.21s    p(95)=2.53s   
    http_req_receiving.........: avg=230.64µs min=15.41µs med=152.78µs max=134.84ms p(90)=372.74µs p(95)=486.32µs
    http_req_sending...........: avg=535.52µs min=5.43µs  med=15.22µs  max=71.5ms   p(90)=74.07µs  p(95)=124.81µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=1.16s    min=9.01ms  med=1.01s    max=7.3s     p(90)=2.21s    p(95)=2.53s   
    http_reqs..................: 25878   422.1684/s
    iteration_duration.........: avg=1.16s    min=9.36ms  med=1.01s    max=7.41s    p(90)=2.22s    p(95)=2.54s   
    iterations.................: 25877   422.152087/s
    vus........................: 137     min=137 max=500
    vus_max....................: 500     min=500 max=500